{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "cell": {},
  "classifier_dropout": null,
  "dtype": "float32",
  "emb_size": 312,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "B-BIOMARKER_NAME",
    "1": "B-BIOMARKER_UNIT",
    "2": "B-BIOMARKER_VALUE",
    "3": "I-BIOMARKER_NAME",
    "4": "I-BIOMARKER_UNIT",
    "5": "I-BIOMARKER_VALUE",
    "6": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1200,
  "label2id": {
    "B-BIOMARKER_NAME": 0,
    "B-BIOMARKER_UNIT": 1,
    "B-BIOMARKER_VALUE": 2,
    "I-BIOMARKER_NAME": 3,
    "I-BIOMARKER_UNIT": 4,
    "I-BIOMARKER_VALUE": 5,
    "O": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "pre_trained": "",
  "structure": [],
  "transformers_version": "4.55.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
