{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "cell": {},
  "classifier_dropout": null,
  "emb_size": 312,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 312,
  "id2label": {
    "0": "O",
    "1": "B-BIOMARKER",
    "2": "I-BIOMARKER",
    "3": "B-VALUE",
    "4": "I-VALUE",
    "5": "B-UNIT",
    "6": "I-UNIT",
    "7": "B-RANGE",
    "8": "I-RANGE",
    "9": "B-STATUS",
    "10": "I-STATUS"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1200,
  "label2id": {
    "B-BIOMARKER": 1,
    "B-RANGE": 7,
    "B-STATUS": 9,
    "B-UNIT": 5,
    "B-VALUE": 3,
    "I-BIOMARKER": 2,
    "I-RANGE": 8,
    "I-STATUS": 10,
    "I-UNIT": 6,
    "I-VALUE": 4,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "pre_trained": "",
  "structure": [],
  "torch_dtype": "float32",
  "transformers_version": "4.55.4",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
